app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages"   ORDER BY "messages"."id" DESC LIMIT 1
---
  def index
    @messages = Message.last

INSERT INTO "messages" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-06-11 13:51:22.926464"], ["text", "sample text"], ["title", "sample title"], ["updated_at", "2015-06-11 13:51:22.926464"]]
---
  def create
    @message = Message.new(message_params)
    @message.save